# IsJournalPlaying Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ControlledApplication..::..IsJournalPlaying Method
ControlledApplication Class See Also
---
Determines if the application is currently in journal playback mode.
**Namespace:** Autodesk.Revit.ApplicationServices**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2020
# Syntax
C#
---
```text
public bool IsJournalPlaying()
```

Visual Basic
---
```text
Public Function IsJournalPlaying As Boolean
```

Visual C++
---
```text
public:
bool IsJournalPlaying()
```

# ### Return Value
true if a journal is currently playing back, false otherwise.
# Remarks
Determines if Revit is in the process of playing back a journal. It can be used to help prevent any user interaction that may cause issues during playback. For more information on Revit's journaling features contact the Autodesk Developer Network.
# See Also
ControlledApplication Class
Autodesk.Revit.ApplicationServices Namespace